import "./ui/Deploy.css";

export default function Deploy() {
    return (
        <div>
            <h1>Публікація на Azure</h1>
            <h2>Передумови</h2>

            <p>
                При публікації статичних застосунків буде необхідно зазначити
                назву директорії, до якої переміщуються файли в результаті
                збірки (build). Для різних систем збирання це можуть бути різні
                імена, наприклад, для класичного Реакту - build, тоді як для
                Vite - це dist. Краще за все запустити процес збирання та
                подивитись на результат (логи або структуру директорій)
                <br />
                <code>npm run build</code>
            </p>
            <p>
                Також перед публікацією проєкт має бути розміщений на
                репозитарії, Azure вільно працює з різними системами, пропонуючи
                за замовчанням GitHub або DevOps
            </p>

            <h2>Створення ресурсу</h2>
            <img src="/img/res1.jpg" alt="res1" />
            <p>
                Ініціюємо створення нового ресурсу, задаємо пошук Static Web App
            </p>
            <br />
            <br />

            <img src="/img/res2.jpg" alt="res2" />
            <p>
                Орієнтуємось за назвою або піктограмою (логотипом) сервісу,
                переходимо до створення
            </p>
            <br />
            <br />

            <img src="/img/res3.jpg" alt="res3" />
            <p>
                Налаштовуємо ресурс: вибираємо ресурсну групу. Головне: обираємо
                бажаний план (Free), вводимо параметри репозиторію, задаємо
                директорію підсумкового результату (збірки) - для системи Vite
                це dist. Натискаємо "Review + Create".
            </p>
            <br />
            <br />

            <img src="/img/res4.jpg" alt="res4" />
            <p>
                Коли з'явиться повідомлення про готовність ресурсу,
                перемикаємось на історію публікації (Deployment history) та
                очікуємо завершення збирання. Сторінку потрібно періодично
                оновлювати або перемикатись на інші вкладки, оскільки статус
                автоматично не оновлюється
            </p>
            <br />
            <br />

            <img src="/img/res5.jpg" alt="res5" />
            <p>
                Коли статус зміниться на "Success" натискаємо перехід до сайту
                (з вкладки Get Started або за URL у властивостях сервісу).
                Переконуємось у працездатності проєкту.
            </p>
            <br />
            <br />

            <h2>Оновлення ресурсу</h2>
            <p>
                Вносимо зміни локально. Перевіряємо усі тести. Після випробувань
                усіх змін виконуємо оновлення репозиторію (push). Це має
                запустити автоматичний процес перезбирання проєкту на Azure.
                Контролюєто його на вкладці Deployment history
            </p>
        </div>
    );
}
